In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [3]:
data=DataFrame(data=np.random.randint(20,100,size=(8,3)),columns=list('ABC'))
data

    A   B   C
0  69  53  21
1  44  33  66
2  82  92  22
3  76  96  82
4  51  66  32
5  78  99  38
6  76  74  23
7  31  59  89

In [4]:
data.loc[1]=77
data.loc[5]=77

In [5]:
data

    A   B   C
0  69  53  21
1  77  77  77
2  82  92  22
3  76  96  82
4  51  66  32
5  77  77  77
6  76  74  23
7  31  59  89

In [7]:
#检查是否与重复项 keep 默认保留第一个first 之后有重复项为True 可以设为last 保留最后一个
# 设为false 一个也不保留
#还可以检查某个字段是否重复
data.duplicated('A')
data.duplicated(keep=False)

0    False
1     True
2    False
3    False
4    False
5     True
6    False
7    False
dtype: bool

In [10]:
data.duplicated(keep='last')

0    False
1     True
2    False
3    False
4    False
5    False
6    False
7    False
dtype: bool

In [11]:
#删除data.drop_duplicates()
data.drop_duplicates(keep='first')

    A   B   C
0  69  53  21
1  77  77  77
2  82  92  22
3  76  96  82
4  51  66  32
6  76  74  23
7  31  59  89